DataProcessors/ПомощникСозданияЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ПомощникСозданияЛицевогоСчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖилойНеЖилойФонд</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖилойНеЖилойФонд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНормеЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТарифыУслугПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТарифыУслугПодробно</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаПодробно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТарифыПороговые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТарифыПороговые</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслугиПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслугиПодробно</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаПодробно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийУправленияУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияУслугами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеНазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКачестваУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПомощникСозданияЛицевогоСчета/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДАЛЬНЫЕ ПЕРЕМЕННЫЕ МАСТЕРА (Клиент)

&НаКлиенте
Перем мТекущийНомерСтраницы;

&НаКлиенте
Перем мСтраницыПомощника;

&НаКлиенте
Перем мКнопкиПомощника;

&НаКлиенте
// Процедура обработки ДеревоКлассификатораВыбранПриИзменении.
//
Процедура ВыбранПриИзменении(ТекущиеДанные)
	
	Если ТекущиеДанные.Выбран = 2 Тогда
		ТекущиеДанные.Выбран = 0;
	КонецЕсли;
	
	ОбходДереваВверх(ТекущиеДанные);
	ОбходДереваВниз(ТекущиеДанные);
	
КонецПроцедуры // ВыбранПриИзменении()

&НаКлиенте
// Процедура обхода дерева вверх.
//
Процедура ОбходДереваВверх(ТекущиеДанные)

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель <> Неопределено Тогда // Верхний уровень
		
		ДочерниеСтроки = Родитель.ПолучитьЭлементы();
		КоличествоВыбранных = 0;
		ОбщееКоличество = 0;
		Для каждого Элемент Из ДочерниеСтроки Цикл
			Если Элемент.Выбран = 2 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 0.5;
			ИначеЕсли Элемент.Выбран = 1 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 1;
			КонецЕсли;
			ОбщееКоличество = ОбщееКоличество + 1;
		КонецЦикла;
		
		Если ОбщееКоличество = КоличествоВыбранных Тогда
			Родитель.Выбран = 1;
		ИначеЕсли КоличествоВыбранных = 0 Тогда
			Родитель.Выбран = 0;
		Иначе
			Родитель.Выбран = 2;
		КонецЕсли;
		
		ОбходДереваВверх(Родитель);
		
	КонецЕсли;
	
КонецПроцедуры // ОбходДереваВверх()

&НаКлиенте
// Процедура обхода дерева вниз.
//
Процедура ОбходДереваВниз(ТекущиеДанные)
	
	ДочерниеСтроки = ТекущиеДанные.ПолучитьЭлементы();
	Для каждого Элемент Из ДочерниеСтроки Цикл
		Элемент.Выбран = ТекущиеДанные.Выбран;
		ОбходДереваВниз(Элемент);
	КонецЦикла;
	
КонецПроцедуры // ОбходДереваВниз()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.Свойство("ЖилойФонд") Тогда
		Если ЗначениеЗаполнено(Параметры.ЖилойФонд) Тогда
			Объект.ЖилойНеЖилойФонд = Параметры.ЖилойФонд;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЖилойНеЖилойФонд) Тогда
		Объект.ЖилойНеЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой;
	КонецЕсли;	
	
	ЭтоЖилойФонд = Объект.ЖилойНеЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой;
	
	Если Параметры.Свойство("Организация") Тогда
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Здание") Тогда
		Если ЗначениеЗаполнено(Параметры.Здание) Тогда
			Объект.Здание = Параметры.Здание;
			Объект.ИмяЛицевогоСчета = СформироватьИмяЛицевогоСчета(Объект.Здание, Объект.ОбъектЛицевогоСчета);	
		КонецЕсли;
	КонецЕсли;
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	мТекущийНомерСтраницы = 0;
	
	ИнициализацияПомощникаНаКлиенте();
	
	УстановитьВидимостьНаКлиенте();
	
	Элементы["Надпись0"].Шрифт = Новый Шрифт(Элементы["Надпись0"].Шрифт ,,,Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ МАСТЕРА

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	СогласиеНаИсправлениеЗаводскихНомеров = Ложь;
	ЗаводскойНомерНеЗаполнен = Ложь; 
	
	Для каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
		Если ПустаяСтрока(СтрокаПриборыУчета.ЗаводскойНомер) Тогда	
			ЗаводскойНомерНеЗаполнен = Истина;	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаводскойНомерНеЗаполнен = Истина и СогласиеНаИсправлениеЗаводскихНомеров = Ложь Тогда
		
		ТекстВопроса = НСтр("ru='Существуют незаполненнве заводские номера.';uk='Існують не заповнені заводскі нормери.'");
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru='Заполните заводские номера, либо они будут заполнены автоматически.';uk='Заповніть заводські номери, або вони будуть заповнені автоматично.'");
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru='Заполнить автоматически?';uk='Заповнити автоматично?'");
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда    
			
			СогласиеНаИсправлениеЗаводскихНомеров = Истина;
			
		Иначе Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СогласиеНаИсправлениеЗаводскихНомеров = Истина Тогда
		
		Для каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			
			Если ПустаяСтрока(СтрокаПриборыУчета.ЗаводскойНомер) Тогда
				
				КодУ = ПолучитьКодУслуги(СтрокаПриборыУчета.Услуга);
				
				СтрокаПриборыУчета.ЗаводскойНомер = Объект.ИмяЛицевогоСчета + КодУ;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ПроверитьТаблицуПриборовУчета() Тогда
		
		ТекстВопроса = НСтр("ru='Существуют не заполненные приборы учета, которые не будут подключены.';uk='Існують не заповнені прилади обліку, які не будуть підключені.'");
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru='Подключение можно выполнить позже.';uk='Підключення можна виконати пізніше.'");
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru='Продолжить?';uk='Продовжити?'");
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда    
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='Подготовлены данные для создания лицевого счета ';uk='Підготовлені дані для створення особового рахунку '")  + Объект.ИмяЛицевогоСчета;
	ТекстВопроса = ТекстВопроса +Символы.ПС + НСтр("ru='Продолжить?';uk='Продовжити?'");
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	
	Если СформироватьОбъекты() Тогда
		
		Оповестить("СозданЛицевойСчет", СсылкаСправочникЛицевыеСчета , ЭтаФорма);
		
		ИзменитьНомерСтраницы(+1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ИзменитьНомерСтраницы(+1);

КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	ИзменитьНомерСтраницы(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура КомандаВНачало(Команда)
	
	мТекущийНомерСтраницы = 0;
	
	Объект.ОбъектЛицевогоСчета = Неопределено;
	Объект.ОтветственныйВладелец = Неопределено;
	Объект.КоличествоПроживающих = 0;
	Объект.КоличествоПрописанных = 0;
		
	Объект.ИмяЛицевогоСчета = "";
	Объект.ИмяЛицевогоСчета = СформироватьИмяЛицевогоСчета(Объект.Здание, Объект.ОбъектЛицевогоСчета);	
	
	ДеревоУслуг.ПолучитьЭлементы().Очистить();
	ПриборыУчета.Очистить();
	
	СсылкаДокументОткрытиеЛицевогоСчета = Неопределено;
	СсылкаДокументУправлениеПотребителямиУслуг = Неопределено;
	СсылкаДокументУправлениеПриборамиУчета = Неопределено;
	СсылкаДокументУправленияУслугами = Неопределено;
	СсылкаДокументУправленияУслугамиПодробно = Неопределено;
	СсылкаСправочникЛицевыеСчета = Неопределено;
	
	УстановитьВидимостьНаКлиенте();
	
	Элементы["Надпись0"].Шрифт = Новый Шрифт(Элементы["Надпись0"].Шрифт ,,,Истина);
	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТаблицуПриборовУчета()
	
	ОК = Истина;
	
	Для каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
		Если НЕ СтрокаПриборыУчета.ДанныеЗаполнены Тогда	
			ОК = Ложь;	
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОК;
	
КонецФункции

&НаСервере
Функция СформироватьОбъекты()
	
	НачатьТранзакцию();
	
	// Справочник лицевые счета
	СправочникЛицевыеСчета = Справочники.ЛицевыеСчета.СоздатьЭлемент();
	СправочникЛицевыеСчета.Владелец = Объект.Здание;
	СправочникЛицевыеСчета.Наименование = Объект.ИмяЛицевогоСчета;
	СправочникЛицевыеСчета.ОбъектЛицевогоСчета = Объект.ОбъектЛицевогоСчета;
	СправочникЛицевыеСчета.Записать();
	
	СсылкаСправочникЛицевыеСчета = СправочникЛицевыеСчета.Ссылка;
	
	// Документ ОткрытиеЛицевогоСчета
	ДокументОткрытиеЛицевогоСчета = Документы.ОткрытиеЛицевогоСчета.СоздатьДокумент();
	ДокументОткрытиеЛицевогоСчета.Автор = Пользователи.ТекущийПользователь();
	ДокументОткрытиеЛицевогоСчета.Дата = Объект.Дата;	
	ДокументОткрытиеЛицевогоСчета.ЛицевойСчет = СсылкаСправочникЛицевыеСчета;
	ДокументОткрытиеЛицевогоСчета.Организация = Объект.Организация;
	ДокументОткрытиеЛицевогоСчета.Здание = Объект.Здание;
	
	ДокументОткрытиеЛицевогоСчета.ОтветственныйВладелец = Объект.ОтветственныйВладелец;
	ДокументОткрытиеЛицевогоСчета.КоличествоПрописанных = Объект.КоличествоПрописанных;
	ДокументОткрытиеЛицевогоСчета.КоличествоПроживающих = Объект.КоличествоПроживающих;
	
	ДокументОткрытиеЛицевогоСчета.Записать(РежимЗаписиДокумента.Проведение);
	
	СсылкаДокументОткрытиеЛицевогоСчета = ДокументОткрытиеЛицевогоСчета.Ссылка;
	
	 //Документ УправлениеУслугами и УправлениеУслугамиПодробно
	Дерево = РеквизитФормыВЗначение("ДеревоУслуг"); 
	ДокументУправлениеУслугами = Документы.УправлениеУслугами.СоздатьДокумент();	
	ДокументУправлениеУслугами.Автор = Пользователи.ТекущийПользователь();
	ДокументУправлениеУслугами.Организация = Объект.Организация;
	ДокументУправлениеУслугами.Дата = Объект.Дата;
	ДокументУправлениеУслугами.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги;
	ДокументУправлениеУслугами.Здание = Объект.Здание;
	ДокументУправлениеУслугами.ДатаНачала = Объект.Дата;
	
	НоваяСтрока = ДокументУправлениеУслугами.ЛицевыеСчета.Добавить();
	НоваяСтрока.ЛицевойСчет = СсылкаСправочникЛицевыеСчета;
	
	Для каждого СтрокаУровень1 Из Дерево.Строки Цикл
		Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
			Если СтрокаУровень2.Выбран >= 1 Тогда	
				НоваяСтрока = ДокументУправлениеУслугами.Услуги.Добавить();	
				НоваяСтрока.Услуга = СтрокаУровень2.Услуга;
				
				Если СтрокаУровень2.Услуга.ВидУслуги = Справочники.ВидыУслуг.СДПТ Тогда
					Если СтрокаУровень2.Строки.Количество() > 0 Тогда
						
						ДокументУправлениеУслугамиПодробно = Документы.УправлениеУслугамиПодробно.СоздатьДокумент();	
						ДокументУправлениеУслугамиПодробно.Автор = Пользователи.ТекущийПользователь();
						ДокументУправлениеУслугамиПодробно.Организация = Объект.Организация;
						ДокументУправлениеУслугамиПодробно.Дата = Объект.Дата;
						ДокументУправлениеУслугамиПодробно.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги;
						ДокументУправлениеУслугамиПодробно.Здание = Объект.Здание;
						ДокументУправлениеУслугамиПодробно.ДатаНачала = Объект.Дата;
						ДокументУправлениеУслугамиПодробно.Услуга = СтрокаУровень2.Услуга;
						
						НоваяСтрокаПодробно = ДокументУправлениеУслугамиПодробно.ЛицевыеСчета.Добавить();
						НоваяСтрокаПодробно.ЛицевойСчет = СсылкаСправочникЛицевыеСчета;
						
						Для каждого СтрокаУровень3 Из СтрокаУровень2.Строки Цикл
							Если СтрокаУровень3.Выбран >= 1 Тогда	
								НоваяСтрокаПодробно = ДокументУправлениеУслугамиПодробно.УслугиПодробно.Добавить();	
								НоваяСтрокаПодробно.УслугаПодробно = СтрокаУровень3.Услуга;
							КонецЕсли;
						КонецЦикла;
							
						Если ДокументУправлениеУслугамиПодробно.УслугиПодробно.Количество() > 0 Тогда
							ДокументУправлениеУслугамиПодробно.Записать(РежимЗаписиДокумента.Проведение);
						
							СсылкаДокументУправленияУслугамиПодробно = ДокументУправлениеУслугамиПодробно.Ссылка;
						КонецЕсли;
	
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если ДокументУправлениеУслугами.Услуги.Количество() > 0 Тогда
		ДокументУправлениеУслугами.Записать(РежимЗаписиДокумента.Проведение);
	
		СсылкаДокументУправленияУслугами = ДокументУправлениеУслугами.Ссылка;
	КонецЕсли;
	
	//Документ Изменение лицевого счета, установка дополнительных реквизитов
	ДокументИзменениеЛицевогоСчета = Документы.ИзменениеЛицевогоСчета.СоздатьДокумент();
	ДокументИзменениеЛицевогоСчета.Автор = Пользователи.ТекущийПользователь();
	ДокументИзменениеЛицевогоСчета.Организация = Объект.Организация;
	ДокументИзменениеЛицевогоСчета.Дата = Объект.Дата;
	ДокументИзменениеЛицевогоСчета.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов;
	ДокументИзменениеЛицевогоСчета.Здание = Объект.Здание;
	ДокументИзменениеЛицевогоСчета.ЛицевойСчет = СсылкаСправочникЛицевыеСчета;
	
	Для Каждого Строка из ДополнительныеРеквизиты Цикл
		НоваяСтрока = ДокументИзменениеЛицевогоСчета.ДополнительныеРеквизиты.Добавить();
		НоваяСтрока.ДополнительныйРеквизит = Строка.ДополнительныйРеквизит;
		НоваяСтрока.Значение = Строка.Значение;
	КонецЦикла;
	
	Если ДокументИзменениеЛицевогоСчета.ДополнительныеРеквизиты.Количество() > 0 тогда
        
	    ДокументИзменениеЛицевогоСчета.Записать(РежимЗаписиДокумента.Проведение);
		
		СсылкаДокументИзменениеЛицевогоСчета = ДокументИзменениеЛицевогоСчета.Ссылка;

	КонецЕсли;
	


	
	
	Если ПриборыУчета.Количество() > 0 Тогда	
		
		Для Каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			// Справочник приборы учета
			Если НЕ СтрокаПриборыУчета.ДанныеЗаполнены Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеПУ  = СтрокаПриборыУчета.ЗаводскойНомер + "/" + СтрокаПриборыУчета.Услуга.ВидУслуги;
			
			СсылкаНаСуществующийПУ = Справочники.ПриборыУчета.НайтиПоНаименованию(НаименованиеПУ);
			
			Если СсылкаНаСуществующийПУ <> Справочники.ПриборыУчета.ПустаяСсылка() Тогда
				 СтрокаПриборыУчета.ПриборУчета = СсылкаНаСуществующийПУ;
			Иначе
				СправочникПриборыУчета = Справочники.ПриборыУчета.СоздатьЭлемент();
				СправочникПриборыУчета.Наименование = СтрокаПриборыУчета.ЗаводскойНомер + "/" + СтрокаПриборыУчета.Услуга.ВидУслуги;
				СправочникПриборыУчета.Услуга = СтрокаПриборыУчета.Услуга;
				СправочникПриборыУчета.ЗаводскойНомер = СтрокаПриборыУчета.ЗаводскойНомер;
				СправочникПриборыУчета.Тарифность  = СтрокаПриборыУчета.Тарифность;
				СправочникПриборыУчета.СпособРегистрацииПоказаний = СтрокаПриборыУчета.СпособРегистрацииПоказаний;
				СправочникПриборыУчета.Коэффициент = СтрокаПриборыУчета.Коэффициент;
				СправочникПриборыУчета.ЕдиницаИзмерения = СтрокаПриборыУчета.ЕдиницаИзмерения;
				СправочникПриборыУчета.Разрядность = СтрокаПриборыУчета.Разрядность;
				
				СправочникПриборыУчета.Записать();
				СтрокаПриборыУчета.ПриборУчета = СправочникПриборыУчета.Ссылка;
			КонецЕсли;
			
		КонецЦикла;	
			
		// Документ управление приборами учета
		ДокументУправлениеПриборамиУчета = Документы.УправлениеПриборамиУчета.СоздатьДокумент();
		ДокументУправлениеПриборамиУчета.Автор = Пользователи.ТекущийПользователь();
		ДокументУправлениеПриборамиУчета.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета;
		ДокументУправлениеПриборамиУчета.ОбъектУстановки = СсылкаСправочникЛицевыеСчета;
		ДокументУправлениеПриборамиУчета.Дата = Объект.Дата;
		ДокументУправлениеПриборамиУчета.Организация = ДокументУправлениеПриборамиУчета.ОбъектУстановки.Владелец.Организация;
		ДокументУправлениеПриборамиУчета.Здание = ДокументУправлениеПриборамиУчета.ОбъектУстановки.Владелец;
		
		ЗаписатьДокументУправлениеПриборамиУчета = Ложь;
			
		Для Каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			
			Если НЕ СтрокаПриборыУчета.ДанныеЗаполнены Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДокументУправлениеПриборамиУчета.ПриборыУчета.Добавить();
			НоваяСтрока.ПриборУчета = СтрокаПриборыУчета.ПриборУчета;
			НоваяСтрока.ДатаВключения = СтрокаПриборыУчета.ДатаУстановки;
			НоваяСтрока.ВидТарифа = СтрокаПриборыУчета.ВидТарифа;
			НоваяСтрока.ДатаПоследнейПоверки = СтрокаПриборыУчета.ДатаПоследнейПоверки;
			НоваяСтрока.ДатаСледующейПоверки = СтрокаПриборыУчета.ДатаСледующейПоверки;
			НоваяСтрока.НачальноеПоказание = СтрокаПриборыУчета.НачальноеПоказание;
			
			ЗаписатьДокументУправлениеПриборамиУчета = Истина;
		КонецЦикла;	
		
		Если ЗаписатьДокументУправлениеПриборамиУчета Тогда
			ДокументУправлениеПриборамиУчета.Записать(РежимЗаписиДокумента.Проведение);
			
			СсылкаДокументУправлениеПриборамиУчета = ДокументУправлениеПриборамиУчета.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьКодУслуги(Услуга)
	
	Возврат Услуга.Код;
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МАСТЕРА

&НаКлиенте
Процедура УстановитьВидимостьНаКлиенте()
	
	// устанавливаем текущую страницу помощника
	Элементы.СтраницыПомощника.ТекущаяСтраница = мСтраницыПомощника[мТекущийНомерСтраницы];
	
	Для а=0 по 3 Цикл
		Элементы["Надпись"+а].Шрифт = Новый Шрифт(Элементы["Надпись"+а].Шрифт ,,,Ложь);
	КонецЦикла;
	
	Элементы["Надпись"+мТекущийНомерСтраницы].Шрифт = Новый Шрифт(Элементы["Надпись"+мТекущийНомерСтраницы].Шрифт ,,,Истина);
	
	// устанавливаем текущую страницу кнопок помощника
	Элементы.КнопкиПомощника.ТекущаяСтраница = мКнопкиПомощника[мТекущийНомерСтраницы];
	
	Если Элементы.СтраницыПомощника.ТекущаяСтраница  = Элементы.СтраницаГотово Тогда
		
		Если НЕ ЗначениеЗаполнено(СсылкаДокументУправленияУслугами) Тогда
			Элементы.КнопкаДокументУправлениеУслугами.Видимость = Ложь;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СсылкаДокументУправленияУслугамиПодробно) Тогда
			Элементы.КнопкаДокументУправлениеУслугамиПодробно.Видимость = Ложь;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СсылкаДокументУправлениеПриборамиУчета) Тогда
			Элементы.КнопкаДокументУправлениеПриборамиУчета.Видимость = Ложь;	
		КонецЕсли;
		
	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница  = Элементы.СтраницаДанныхОУслугах Тогда
		
		ЗаполнитьДеревоУслугНаСервере();
		
	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница  = Элементы.СтраницаДанныхОПриборахУчета Тогда
		
		ЗаполнитьПриборыУчетаНаСервере();
		
	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница  = Элементы.СтраницаДанныхОПомещении Тогда
		
		Если ЭтоЖилойФонд Тогда
			Элементы.КоличествоПроживающих.Видимость = Истина;
			Элементы.КоличествоПрописанных.Видимость = Истина;
		Иначе
			Элементы.КоличествоПроживающих.Видимость = Ложь;
			Элементы.КоличествоПрописанных.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНомерСтраницы(Итератор)
	
	Отказ = Ложь;
	
	Если Итератор > 0 Тогда
		ВыполнитьПроверкуЗаполненияСтраницы(Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// изменяем номер текущей страницы
	Инкремент(мТекущийНомерСтраницы, Итератор);
	
	// отображаем новую страницу помощника
	УстановитьВидимостьНаКлиенте();
	
	Если мТекущийНомерСтраницы = 1 И Итератор = 1 Тогда
		
		Совпадение = ИзменениеОбъектаЛицевогоСчета();
	
		Если Совпадение = Ложь Тогда  	
			ТекстВопроса = НСтр("ru='Параметры шаблона лицевого счета не совпадают с параметрами объекта лицевого счета. 
				|                          Очистить шаблон лицевого счета?';uk='Параметри шаблону особового рахунку не співпадають з параметрами об''єкту особового рахунку. 
				|                          Очистити шаблон особового рахунку?'");
			
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
			
			Если Ответ = КодВозвратаДиалога.Да Тогда    
				
				Объект.ШаблонЛицевогоСчета = Неопределено;
				
			КонецЕсли;

		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Инкремент(Число, Знач Итератор = 1)
	
	Число = Число + Итератор;
	
КонецПроцедуры

&НаКлиенте
 Процедура ИнициализацияПомощникаНаКлиенте()
	
	мСтраницыПомощника  = Новый Соответствие;
	мКнопкиПомощника    = Новый Соответствие;
	
	// СТРАНИЦЫ ПОМОЩНИКА
	
	мСтраницыПомощника.Вставить(0 ,  Элементы.СтраницаДанныхОПомещении);
	мСтраницыПомощника.Вставить(1 ,  Элементы.СтраницаДанныхОУслугах);
	мСтраницыПомощника.Вставить(2 ,  Элементы.СтраницаДанныхОПриборахУчета);
	мСтраницыПомощника.Вставить(3 ,  Элементы.СтраницаГотово);
	
	
	мКнопкиПомощника.Вставить(0 ,  Элементы.КнопкиНачала);
	мКнопкиПомощника.Вставить(1 ,  Элементы.КнопкиПродолжения);
	мКнопкиПомощника.Вставить(2 ,  Элементы.КнопкиГотово);
	мКнопкиПомощника.Вставить(3 ,  Элементы.КнопкиОкончания);
	
КонецПроцедуры

 &НаКлиенте
Процедура ВыполнитьПроверкуЗаполненияСтраницы(Отказ)
	
	Если Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДанныхОПомещении Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			НСтрока = НСтр("ru='Не заполнено поле Дата';uk='Не заповнене поле Дата'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.Дата",, Отказ);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			НСтрока = НСтр("ru='Не заполнено поле Организация';uk='Не заповнене поле Організація'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.Организация",, Отказ);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
			НСтрока = НСтр("ru='Не заполнено поле Здание';uk='Не заповнене поле Будинок'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.Здание",, Отказ);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ОбъектЛицевогоСчета) Тогда
			НСтрока = НСтр("ru='Не заполнено поле Объект лицевого счета';uk=""Не заповнене поле Об'єкт особового рахунку""");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.ОбъектЛицевогоСчета",, Отказ);
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ОтветственныйВладелец) Тогда
			НСтрока = НСтр("ru='Не заполнено поле Ответственный владелец';uk='Не заповнене поле Відповідальний власник'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.ОтветственныйВладелец",, Отказ);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция СформироватьИмяЛицевогоСчета(Здание, ОбъектЛицевогоСчета)
//{{MRG[ <-> ]
//	Запрос = Новый Запрос;
//}}MRG[ <-> ]
	Если НЕ ЗначениеЗаполнено(Здание) Или НЕ ЗначениеЗаполнено(ОбъектЛицевогоСчета) Тогда
//{{MRG[ <-> ]
		Возврат "";	
	КонецЕсли;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Запрос.Текст = 
//	    "ВЫБРАТЬ
//	    |	МАКСИМУМ(ЛицевыеСчетаСрезПоследних.ЛицевойСчет) КАК ЛицевойСчет
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	    |ИЗ
//}}MRG[ <-> ]
	КодПодъезда = Формат(ОбъектЛицевогоСчета.Подъезд.НомерПодъезда, "ЧЦ=3; ЧВН=") + СокрЛП(ОбъектЛицевогоСчета.Подъезд.Суффикс);
//{{MRG[ <-> ]
	КодКвартиры = Формат(ОбъектЛицевогоСчета.Код, "ЧЦ=3; ЧВН=") + СокрЛП(ОбъектЛицевогоСчета.Суффикс);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних КАК ЛицевыеСчетаСрезПоследних";
//	РезультатЗапроса = Запрос.Выполнить();
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Выборка = РезультатЗапроса.Выбрать();
//}}MRG[ <-> ]
	Возврат СокрЛП(Здание.ПрефиксЛицевыхСчетов) + КодПодъезда + КодКвартиры;
//{{MRG[ <-> ]
//	Пока Выборка.Следующий() Цикл
//		ЛС = Выборка.ЛицевойСчет;
//	КонецЦикла;
//	ЛС1 = Число(ЛС.Наименование) + 1;
//	Возврат СтрЗаменить(Строка(ЛС1), Символы.НПП, "");
//	//Если НЕ ЗначениеЗаполнено(Здание) Или НЕ ЗначениеЗаполнено(ОбъектЛицевогоСчета) Тогда
//	//	Возврат "";	
//	//КонецЕсли;
//	//
//	//КодПодъезда = Формат(ОбъектЛицевогоСчета.Подъезд.НомерПодъезда, "ЧЦ=3; ЧВН=") + СокрЛП(ОбъектЛицевогоСчета.Подъезд.Суффикс);
//	//КодКвартиры = Формат(ОбъектЛицевогоСчета.Код, "ЧЦ=3; ЧВН=") + СокрЛП(ОбъектЛицевогоСчета.Суффикс);
//	//
//	//Возврат СокрЛП(Здание.ПрефиксЛицевыхСчетов) + КодПодъезда + КодКвартиры;
//}}MRG[ <-> ]
	
КонецФункции // СформироватьИмяЛицевогоСчета()

&НаКлиенте
Процедура КомандаСправочникЛицевойСчет(Команда)
	
	ОткрытьФормуМодально("Справочник.ЛицевыеСчета.ФормаОбъекта", Новый Структура("Ключ", СсылкаСправочникЛицевыеСчета));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументУправлениеУслугами(Команда)
	
	ОткрытьФормуМодально("Документ.УправлениеУслугами.ФормаОбъекта", Новый Структура("Ключ", СсылкаДокументУправленияУслугами));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументУправлениеУслугамиПодробно(Команда)
	
	ОткрытьФормуМодально("Документ.УправлениеУслугамиПодробно.ФормаОбъекта", Новый Структура("Ключ", СсылкаДокументУправленияУслугамиПодробно));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОткрытиеЛицевогоСчета(Команда)
	
	ОткрытьФормуМодально("Документ.ОткрытиеЛицевогоСчета.ФормаОбъекта", Новый Структура("Ключ", СсылкаДокументОткрытиеЛицевогоСчета));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументУправлениеПриборамиУчета(Команда)
	
	ОткрытьФормуМодально("Документ.УправлениеПриборамиУчета.ФормаОбъекта", Новый Структура("Ключ", СсылкаДокументУправлениеПриборамиУчета));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументИзменениеЛицевогоСчета(Команда)
	
	ОткрытьФормуМодально("Документ.ИзменениеЛицевогоСчета.ФормаОбъекта", Новый Структура("Ключ", СсылкаДокументИзменениеЛицевогоСчета));
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДеревоУслугНаСервере(Перезаполнить = Ложь)
	
    Дерево = РеквизитФормыВЗначение("ДеревоУслуг");
	КвоСтрокУслуг = Дерево.Строки.Количество();
	Если КвоСтрокУслуг > 0 И Не Перезаполнить Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьУслугиСДПТПодробно = ПолучитьФункциональнуюОпцию("ИспользоватьУслугиСДПТПодробно");
	
	Если ИспользоватьУслугиСДПТПодробно	Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТарифыСрезПоследних.Услуга КАК Услуга,
		|	ТарифыСрезПоследних.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТарифыСрезПоследних.Услуга.Родитель КАК Родитель,
		|	ТарифыУслугПодробноСрезПоследних.УслугаПодробно КАК УслугаПодробно
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Здание = &Здание
		|				И ЗначениеТарифа > 0) КАК ТарифыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыУслугПодробно.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Здание = &Здание
		|					И ЗначениеТарифа > 0) КАК ТарифыУслугПодробноСрезПоследних
		|		ПО ТарифыСрезПоследних.Услуга = ТарифыУслугПодробноСрезПоследних.Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСрезПоследних.Услуга.Родитель,
		|	ТарифыСрезПоследних.Услуга,
		|	ТарифыСрезПоследних.Услуга.ЕдиницаИзмерения,
		|	ТарифыУслугПодробноСрезПоследних.УслугаПодробно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТарифыПороговыеСрезПоследних.Услуга,
		|	ТарифыПороговыеСрезПоследних.Услуга.ЕдиницаИзмерения,
		|	ТарифыПороговыеСрезПоследних.Услуга.Родитель,
		|	NULL
		|ИЗ
		|	РегистрСведений.ТарифыПороговые.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Здание = &Здание
		|				И ЗначениеТарифа > 0) КАК ТарифыПороговыеСрезПоследних
		|ИТОГИ ПО
		|	Родитель,
		|	Услуга,
		|	УслугаПодробно";
		
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТарифыСрезПоследних.Услуга КАК Услуга,
		|	ТарифыСрезПоследних.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТарифыСрезПоследних.Услуга.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Здание = &Здание
		|				И ЗначениеТарифа > 0) КАК ТарифыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыСрезПоследних.Услуга.Родитель,
		|	ТарифыСрезПоследних.Услуга,
		|	ТарифыСрезПоследних.Услуга.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТарифыПороговыеСрезПоследних.Услуга,
		|	ТарифыПороговыеСрезПоследних.Услуга.ЕдиницаИзмерения,
		|	ТарифыПороговыеСрезПоследних.Услуга.Родитель
		|ИЗ
		|	РегистрСведений.ТарифыПороговые.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Здание = &Здание
		|				И ЗначениеТарифа > 0) КАК ТарифыПороговыеСрезПоследних
		|ИТОГИ ПО
		|	Родитель,
		|	Услуга";
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	
	Дерево.Строки.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка.Следующий() Цикл
		СтрокаУровень1 = Дерево.Строки.Добавить();
		СтрокаУровень1.Услуга = Выборка.Родитель;
		СтрокаУровень1.Выбран = 1;
		ВыборкаУслуга = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			СтрокаУровень2= СтрокаУровень1.Строки.Добавить();
			СтрокаУровень2.Услуга = ВыборкаУслуга.Услуга;
			СтрокаУровень2.Выбран = 1;
			Если ИспользоватьУслугиСДПТПодробно Тогда
				ВыборкаУслугаПодробно = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаУслугаПодробно.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаУслугаПодробно.УслугаПодробно) Тогда
						СтрокаУровень3= СтрокаУровень2.Строки.Добавить();
						СтрокаУровень3.Услуга = ВыборкаУслугаПодробно.УслугаПодробно;
						СтрокаУровень3.Выбран = 1;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоУслуг");

	Если КвоСтрокУслуг = 0 И ЗначениеЗаполнено(Объект.ШаблонЛицевогоСчета) Тогда
	
		ЗаполнитьУслугиПоШаблонуНаСервере();
	
	КонецЕсли; 
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПриборыУчетаНаСервере()
	
    УслугиДерево = РеквизитФормыВЗначение("ДеревоУслуг");
	Если УслугиДерево.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаУровень1 Из УслугиДерево.Строки Цикл
		Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
			Если СтрокаУровень2.Выбран = 1 И СтрокаУровень2.Услуга.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета И НЕ СтрокаУровень2.Услуга.ВидУслуги = Справочники.ВидыУслуг.Водоотведение Тогда	
				Если ПриборыУчета.НайтиСтроки(Новый Структура("Услуга", СтрокаУровень2.Услуга)).Количество() = 0 Тогда
				    //Выполняем заполнение по видам тарифа
					Если СтрокаУровень2.Услуга.ПоВидамТарифа Тогда
						ТаблицаТарифов  = СтрокаУровень2.Услуга.ВидыТарифов;
						Если ТаблицаТарифов.Количество() <> 0 Тогда
							Если ТаблицаТарифов.Количество() = 1 Тогда
								ТарифностьПрибора = Перечисления.ТарифностьСчетчиков.Однотарифный;
							ИначеЕсли ТаблицаТарифов.Количество() = 2  Тогда 
								ТарифностьПрибора = Перечисления.ТарифностьСчетчиков.Двухтарифный;
							Иначе 	
								ТарифностьПрибора = Перечисления.ТарифностьСчетчиков.Трехтарифный;
							КонецЕсли; 	
							Для Каждого Строка из ТаблицаТарифов Цикл
								НоваяСтрокаПриборыУчета = ПриборыУчета.Добавить(); 
								НоваяСтрокаПриборыУчета.Услуга = СтрокаУровень2.Услуга;
								НоваяСтрокаПриборыУчета.ДатаУстановки = Объект.Дата;
								НоваяСтрокаПриборыУчета.ВидТарифа = Строка.ВидТарифа;
								НоваяСтрокаПриборыУчета.Тарифность = ТарифностьПрибора;
								НоваяСтрокаПриборыУчета.СпособРегистрацииПоказаний = Перечисления.СпособыРегистрацииПоказанийСчетчиков.НарастающимИтогом;
								НоваяСтрокаПриборыУчета.Коэффициент = 1;
								НоваяСтрокаПриборыУчета.ЕдиницаИзмерения = СтрокаУровень2.Услуга.ЕдиницаИзмерения;
								НоваяСтрокаПриборыУчета.Разрядность = 6;
							КонецЦикла;	
						Иначе
							
							НоваяСтрокаПриборыУчета = ПриборыУчета.Добавить(); 
							НоваяСтрокаПриборыУчета.Услуга = СтрокаУровень2.Услуга;
							НоваяСтрокаПриборыУчета.ДатаУстановки = Объект.Дата;
							НоваяСтрокаПриборыУчета.ВидТарифа = Перечисления.ВидыТарифов.Общий;
							НоваяСтрокаПриборыУчета.Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный;
							НоваяСтрокаПриборыУчета.СпособРегистрацииПоказаний = Перечисления.СпособыРегистрацииПоказанийСчетчиков.НарастающимИтогом;
							НоваяСтрокаПриборыУчета.Коэффициент = 1;
							НоваяСтрокаПриборыУчета.ЕдиницаИзмерения = СтрокаУровень2.Услуга.ЕдиницаИзмерения;
							НоваяСтрокаПриборыУчета.Разрядность = 6;
						КонецЕсли;
					Иначе
						НоваяСтрокаПриборыУчета = ПриборыУчета.Добавить(); 
						НоваяСтрокаПриборыУчета.Услуга = СтрокаУровень2.Услуга;
						НоваяСтрокаПриборыУчета.ДатаУстановки = Объект.Дата;
						НоваяСтрокаПриборыУчета.ВидТарифа = Перечисления.ВидыТарифов.Общий;
						НоваяСтрокаПриборыУчета.Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный;
						НоваяСтрокаПриборыУчета.СпособРегистрацииПоказаний = Перечисления.СпособыРегистрацииПоказанийСчетчиков.НарастающимИтогом;
						НоваяСтрокаПриборыУчета.Коэффициент = 1;
						НоваяСтрокаПриборыУчета.ЕдиницаИзмерения = СтрокаУровень2.Услуга.ЕдиницаИзмерения;
						НоваяСтрокаПриборыУчета.Разрядность = 6;
					КонецЕсли;
					
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры	

&НаСервереБезКонтекста
Функция ОпределитьЭтоЖилойФонд(ЖилойФонд)
	
	Возврат ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой;

КонецФункции

&НаКлиенте
Процедура ЖилойФондПриИзменении(Элемент)
	
	ЭтоЖилойФонд = ОпределитьЭтоЖилойФонд(Объект.ЖилойНеЖилойФонд);
	УстановитьВидимостьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУслугВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоУслуг.ТекущиеДанные;
	ВыбранПриИзменении(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиПоШаблонуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонЛицевогоСчета) Тогда
		Возврат;
	КонецЕсли;
	
    Дерево = РеквизитФормыВЗначение("ДеревоУслуг");

	ИспользоватьУслугиСДПТПодробно = ПолучитьФункциональнуюОпцию("ИспользоватьУслугиСДПТПодробно");
	
	Если ИспользоватьУслугиСДПТПодробно	Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НазначенныеУслугиСрезПоследних.Услуга,
		|	ВложенныйЗапрос.УслугаПодробно
		|ИЗ
		|	РегистрСведений.НазначенныеУслуги.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних,
		|	(ВЫБРАТЬ
		|		НазначенныеУслугиПодробноСрезПоследних.УслугаПодробно КАК УслугаПодробно
		|	ИЗ
		|		РегистрСведений.НазначенныеУслугиПодробно.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиПодробноСрезПоследних
		|	ГДЕ
		|		НазначенныеУслугиПодробноСрезПоследних.Действует = ИСТИНА) КАК ВложенныйЗапрос
		|ГДЕ
		|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА";
	
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НазначенныеУслугиСрезПоследних.Услуга
		|ИЗ
		|	РегистрСведений.НазначенныеУслуги.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
		|ГДЕ
		|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ШаблонЛицевогоСчета);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаУровень1 Из Дерево.Строки Цикл
		Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
			Если РезультатЗапроса.Найти(СтрокаУровень2.Услуга,"Услуга") = Неопределено Тогда
				СтрокаУровень2.Выбран = 0;	
			Иначе
				СтрокаУровень2.Выбран = 1;	
			КонецЕсли;
			
			Если ИспользоватьУслугиСДПТПодробно	Тогда
			
				Для каждого СтрокаУровень3 Из СтрокаУровень2.Строки Цикл
					Отбор = Новый Структура("Услуга, УслугаПодробно", СтрокаУровень2.Услуга, СтрокаУровень3.Услуга);
					
					Если РезультатЗапроса.НайтиСтроки(Отбор).Количество() = 0  Тогда
						СтрокаУровень3.Выбран = 0;	
					Иначе
						СтрокаУровень3.Выбран = 1;	
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоУслуг");
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнитьУслугиПоШаблону(Команда)
	
	ЗаполнитьУслугиПоШаблонуНаСервере();
	
	СтрокиДерева = ДеревоУслуг.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоУслуг.Развернуть(ИдентификаторСтроки, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектЛицевогоСчетаЗанят(ОбъектЛицевогоСчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних КАК ЛицевыеСчетаСрезПоследних
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА
		|	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = &ОбъектЛицевогоСчета";
		
		
	Запрос.УстановитьПараметр("ОбъектЛицевогоСчета", ОбъектЛицевогоСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОбъектЛицевогоСчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ОбъектЛицевогоСчетаЗанят(ВыбранноеЗначение) Тогда
		
		НСтрока = НСтр("ru='На объект уже выписан лицевой счет';uk=""На об'єкт уже виписаний особовий рахунок""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.ОбъектЛицевогоСчета");
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяЛицевогоСчета) Тогда
		Объект.ИмяЛицевогоСчета = СформироватьИмяЛицевогоСчета(Объект.Здание, Объект.ОбъектЛицевогоСчета);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЛицевогоСчетаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяЛицевогоСчета) Тогда
		Объект.ИмяЛицевогоСчета = СформироватьИмяЛицевогоСчета(Объект.Здание, Объект.ОбъектЛицевогоСчета);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаУстановки) 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Тарифность) 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СпособРегистрацииПоказаний) 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Коэффициент) 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Разрядность) 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЕдиницаИзмерения) Тогда
		
			Элемент.ТекущиеДанные.ДанныеЗаполнены = Истина;
		
	Иначе
		Элемент.ТекущиеДанные.ДанныеЗаполнены = Ложь;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЛицевогоСчетаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ШаблонЛицевогоСчета) Тогда
		ЗаполнитьУслугиПоШаблонуНаСервере();
	Иначе
		ЗаполнитьДеревоУслугНаСервере(Истина);		
	КонецЕсли; 
	
	СтрокиДерева = ДеревоУслуг.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоУслуг.Развернуть(ИдентификаторСтроки, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте                        
Процедура ПриборыУчетаДатаПоследнейПоверкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПриборыУчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаСледующейПоверки) Тогда
		НайденныеСтроки = РазницаДатПоверкиПриборовУчета.НайтиСтроки(Новый Структура("Услуга", ТекущиеДанные.Услуга));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = РазницаДатПоверкиПриборовУчета.Добавить();
			НоваяСтрока.Услуга = ТекущиеДанные.Услуга;
			НоваяСтрока.РазницаДат = ТекущиеДанные.ДатаСледующейПоверки - ТекущиеДанные.ДатаПоследнейПоверки;
		Иначе
			НайденныеСтроки[0].РазницаДат = ТекущиеДанные.ДатаСледующейПоверки - ТекущиеДанные.ДатаПоследнейПоверки;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаСледующейПоверки) Тогда
		НайденныеСтроки = РазницаДатПоверкиПриборовУчета.НайтиСтроки(Новый Структура("Услуга", ТекущиеДанные.Услуга));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущиеДанные.ДатаСледующейПоверки = ТекущиеДанные.ДатаПоследнейПоверки + НайденныеСтроки[0].РазницаДат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаДатаСледующейПоверкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПриборыУчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаСледующейПоверки) Тогда
		НайденныеСтроки = РазницаДатПоверкиПриборовУчета.НайтиСтроки(Новый Структура("Услуга", ТекущиеДанные.Услуга));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = РазницаДатПоверкиПриборовУчета.Добавить();
			НоваяСтрока.Услуга = ТекущиеДанные.Услуга;
			НоваяСтрока.РазницаДат = ТекущиеДанные.ДатаСледующейПоверки - ТекущиеДанные.ДатаПоследнейПоверки;
		Иначе
			НайденныеСтроки[0].РазницаДат = ТекущиеДанные.ДатаСледующейПоверки - ТекущиеДанные.ДатаПоследнейПоверки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
 Функция ИзменениеОбъектаЛицевогоСчета()
	
	Совпадение = Истина;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь = ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.Площадь КАК Совпадение
	                |ИЗ
	                |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних1
	                |		ПО ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.ВидПлощади
	                |ГДЕ
	                |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение = &Объект1
	                |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.Помещение = &Объект2
	                |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = &Общая
	                |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.ВидПлощади = &Общая
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь = ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.Площадь
	                |ИЗ
	                |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних1
	                |		ПО ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.ВидПлощади
	                |ГДЕ
	                |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение = &Объект1
	                |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.Помещение = &Объект2
	                |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = &Отапливаемая
	                |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних1.ВидПлощади = &Отапливаемая";
	
	Запрос.УстановитьПараметр("Объект1", Объект.ОбъектЛицевогоСчета);
	Запрос.УстановитьПараметр("Объект2", Объект.ШаблонЛицевогоСчета.ОбъектЛицевогоСчета);
	Запрос.УстановитьПараметр("Общая", Справочники.ВидыПлощадей.ОбщаяПлощадь);
	Запрос.УстановитьПараметр("Отапливаемая", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.Совпадение = Ложь Тогда
			
			Совпадение = Ложь;
			
			Возврат Совпадение;
			
		КонецЕсли
			
	КонецЦикла;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ОбъектыЛицевыхСчетов.КоличествоКомнат = ОбъектыЛицевыхСчетов1.КоличествоКомнат КАК Совпадение
	                |ИЗ
	                |	Справочник.ОбъектыЛицевыхСчетов КАК ОбъектыЛицевыхСчетов,
	                |	Справочник.ОбъектыЛицевыхСчетов КАК ОбъектыЛицевыхСчетов1
	                |ГДЕ
	                |	ОбъектыЛицевыхСчетов.Ссылка = &Объект1
	                |	И ОбъектыЛицевыхСчетов1.Ссылка = &Объект2";
	
	Запрос.УстановитьПараметр("Объект1", Объект.ОбъектЛицевогоСчета);
	Запрос.УстановитьПараметр("Объект2", Объект.ШаблонЛицевогоСчета.ОбъектЛицевогоСчета);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.Совпадение = Ложь Тогда
			
			Совпадение = Ложь;
			
			Возврат Совпадение;
			
		КонецЕсли
			
	КонецЦикла;

КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ТаблицаРазницаДатПоверкиПриборовУчета = Настройки.Получить("РазницаДатПоверкиПриборовУчета");
	Если НЕ ТаблицаРазницаДатПоверкиПриборовУчета = Неопределено Тогда
		РазницаДатПоверкиПриборовУчета.Загрузить(ТаблицаРазницаДатПоверкиПриборовУчета);
	КонецЕсли;
	
КонецПроцедуры
